BlackPear/test cases/smsp.getPatientDetails.advise when no match.res.xml

<?xml version='1.0' encoding='UTF-8'?>
<soap:Envelope xmlns:hl7="urn:hl7-org:v3" xmlns:itk="urn:nhs-itk:ns:201005" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soap:Header>
        <wsa:MessageID>75B3C43E-5DBE-11E8-92FD-6C3BE5A861CE</wsa:MessageID>
        <wsa:Action>urn:nhs-itk:services:201005:getPatientDetails-v1-0Response</wsa:Action>
    </soap:Header>
    <soap:Body>
        <itk:DistributionEnvelope>
            <itk:header service="urn:nhs-itk:services:201005:getPatientDetails-v1-0Response" trackingid="75B3C8E4-5DBE-11E8-92FD-6C3BE5A861CE">
                <itk:manifest count="1">
                    <itk:manifestitem base64="false" compressed="false" encrypted="false" id="uuid_759BF124-5DBE-11E8-92FD-6C3BE5A861CE" mimetype="text/xml" profileid="urn:nhs-en:profile:getPatientDetailsResponse-v1-0"/>
                </itk:manifest>
            </itk:header>
            <itk:payloads count="1">
                <itk:payload id="uuid_759BF124-5DBE-11E8-92FD-6C3BE5A861CE">
                    <getPatientDetailsResponse-v1-0 classCode="OBS" moodCode="EVN" xmlns="urn:hl7-org:v3">
                        <id root="759BF124-5DBE-11E8-92FD-6C3BE5A861CE"/>
                        <code code="getPatientDetailsResponse-v1-0" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.284"/>
                        <value code="DEMOG-0001" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.285"/>
                    </getPatientDetailsResponse-v1-0>
                </itk:payload>
            </itk:payloads>
        </itk:DistributionEnvelope>
    </soap:Body>
</soap:Envelope>