source/build/package-templates/hdn-itk-documentation/hdn-itk-documentation/srv/hdn-itk-documentation/itk/docs/samples/GetPatientDetailsByNHSNumberResponse.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--This example message is provided for illustrative purposes only. It has had no clinical validation. Whilst every effort has been taken to ensure that the examples are consistent with the message specification, where there are conflicts with the written message specification or schema, the specification or schema shall be considered to take precedence-->
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:itk="urn:nhs-itk:ns:201005">
	<soap:Header>
		<wsa:MessageID>__MESSAGEID__</wsa:MessageID>
		<wsa:Action>urn:nhs-itk:services:201005:getPatientDetailsByNHSNumber-v1-0Response</wsa:Action>
		<wsa:To>__SENDTO__</wsa:To>
		<wsa:From>
			<wsa:Address>http://localhost:4000</wsa:Address>
		</wsa:From>
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="D6CD5232-14CF-11DF-9423-1F9A910D4703">
				<wsu:Created>__TIMESTAMP__</wsu:Created>
				<wsu:Expires>__EXPIRES__</wsu:Expires>
			</wsu:Timestamp>
			<wsse:UsernameToken>
				<wsse:Username>TKS Server test</wsse:Username>
			</wsse:UsernameToken>
		</wsse:Security>
	</soap:Header>
	<soap:Body>
		<itk:DistributionEnvelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
			<itk:header service="urn:nhs-itk:services:201005:getPatientDetailsByNHSNumber-v1-0Response" trackingid="2D37D9CA-5223-41C7-A159-F33D5A914EB5">
				<itk:auditIdentity>
					<itk:id type="2.16.840.1.113883.2.1.3.2.4.18.27" uri="urn:nhs-uk:addressing:ods:rhm:team1:C"/>
				</itk:auditIdentity>
				<itk:manifest count="1">
					<itk:manifestitem id="uuid_808A967-49B2-498B-AD75-1D7A0F1262D7" mimetype="text/xml" profileid="urn:nhs-en:profile:getPatientDetailsResponse-v1-0" base64="false" compressed="false" encrypted="false"/>
				</itk:manifest>
				<itk:senderAddress uri="urn:nhs-uk:addressing:ods:rhm:team1:C"/>
			</itk:header>
			<itk:payloads count="1">
				<itk:payload id="uuid_808A967-49B2-498B-AD75-1D7A0F1262D7">
					<getPatientDetailsResponse-v1-0 xmlns="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" moodCode="EVN" classCode="OBS">
						<id root="4E25ACE2-23F8-4A37-B446-6A37F31BF76C"/>
						<code codeSystem="2.16.840.1.113883.2.1.3.2.4.17.284" code="getPatientDetailsResponse-v1-0"/>
						<value codeSystem="2.16.840.1.113883.2.1.3.2.4.17.285" code="SMSP-0000"/>
						<subject typeCode="SBJ">
							<patient classCode="PAT">
								<id root="2.16.840.1.113883.2.1.4.1" extension="9999345201"/>
								<name>
									<given>John</given>
									<family>Smith</family>
								</name>
								<addr use="H">
									<postalCode>LS17 7TR</postalCode>
									<streetAddressLine>41 Manor Grove</streetAddressLine>
									<streetAddressLine>Little Manorton</streetAddressLine>
									<streetAddressLine>Leeds</streetAddressLine>
									<streetAddressLine/>
									<streetAddressLine/>
								</addr>
								<patientPerson determinerCode="INSTANCE" classCode="PSN">
									<administrativeGenderCode code="1" codeSystem="2.16.840.1.113883.2.1.3.2.4.16.25"/>
									<birthTime value="19890101"/>
									<gPPractice classCode="SDLOC">
										<addr>
											<postalCode>LS17 8TY</postalCode>
											<streetAddressLine>2 High Street</streetAddressLine>
											<streetAddressLine>Little Manorton</streetAddressLine>
											<streetAddressLine>Leeds</streetAddressLine>
											<streetAddressLine/>
											<streetAddressLine/>
										</addr>
										<locationOrganization determinerCode="INSTANCE" classCode="ORG">
											<id root="2.16.840.1.113883.2.1.3.2.4.19.2" extension="YT4"/>
											<name>Grove GP Surgery</name>
										</locationOrganization>
									</gPPractice>
								</patientPerson>
							</patient>
							
						</subject>
					</getPatientDetailsResponse-v1-0>
				</itk:payload>
			</itk:payloads>
		</itk:DistributionEnvelope>
	</soap:Body>
</soap:Envelope>